'use strict'

const userCode = {
  30000: '登录失败',
  30001: '验证码错误',
  30002: '用户不存在',
  30003: '用户名或密码错误',
}

const CodeMessage = {
  getMessage (code) {
    return this[code] || ''
  },
  0: '成功',
  1: '创建成功',
  2: '更新成功',
  3: '删除成功',
  9999: '服务器未知错误',
  10000: '未携带令牌',
  10010: '授权失败',
  10020: '资源不存在',
  10030: '参数错误',
  10040: '令牌失效',
  10050: '令牌过期',
  10060: '字段重复',
  10070: '禁止操作',
  10080: '请求方法不允许',
  10100: '刷新令牌获取失败',
  10110: '{name}大小不能超过{size}字节',
  10120: '文件数量过多',
  10130: '不支持类型为{ext}的文件',
  10140: '请求过于频繁，请稍后重试',
  10200: '失败',
  ...userCode,
}

export default CodeMessage
